In [1]:
import os
import pandas as pd
import requests
import zipfile
from sqlalchemy import create_engine
from sqlalchemy import text

In [2]:
url = 'https://files.grouplens.org/datasets/movielens/ml-latest-small.zip'
r = requests.get(url)

In [3]:
with open('ml-latest-small.zip', 'wb') as f:
    f.write(r.content)

In [4]:
with zipfile.ZipFile('ml-latest-small.zip', 'r') as zip_ref:
    zip_ref.extractall('ml-latest-small')

In [5]:
db_url = 'postgresql://user:password@db:5432/moviedb'
engine = create_engine(db_url)

In [6]:
movies = pd.read_csv('ml-latest-small/ml-latest-small/movies.csv')
ratings = pd.read_csv('ml-latest-small/ml-latest-small/ratings.csv')

In [7]:
movies.to_sql('movies', engine, if_exists='replace', index=False)
ratings.to_sql('ratings', engine, if_exists='replace', index=False)

836

### 1. How many movies are in data set?

In [8]:
query = """
SELECT COUNT(title) 
FROM movies
"""
task_1 = pd.read_sql(query, engine)
print(f"{task_1.iloc[0, 0]}")

9742

### 2. What is the most common genre of movie?

In [9]:
query = """
SELECT genre, COUNT(genre) AS count 
FROM (
    SELECT unnest(string_to_array(movies.genres, '|')) AS genre
    FROM movies
) genre_table
GROUP BY genre
ORDER BY count DESC
LIMIT 1;
"""
task_2 = pd.read_sql(query, engine)
print(f"{task_2.iloc[0, 0]}: {task_2.iloc[0, 1]}")

Drama: 4361

### 3. What are top 10 movies with highest rate?

In [10]:
query = """
SELECT movies.title, AVG(ratings.rating) AS rate
FROM ratings
JOIN movies ON movies."movieId" = ratings."movieId"
GROUP BY movies.title
ORDER BY rate DESC
LIMIT 10;
"""
task_3 = pd.read_sql(query, engine)
task_3

                                            title  rate
0                           Brother (Brat) (1997)   5.0
1                                      Eva (2011)   5.0
2       Go for Zucker! (Alles auf Zucker!) (2004)   5.0
3                              Holy Motors (2012)   5.0
4  Story of Women (Affaire de femmes, Une) (1988)   5.0
5                  Watching the Detectives (2007)   5.0
6                         Girls About Town (1931)   5.0
7                              Connections (1978)   5.0
8                Nasu: Summer in Andalusia (2003)   5.0
9                           Into the Woods (1991)   5.0

### 4. What are 5 most often rating users?

In [11]:
query = """
SELECT ratings."userId", COUNT(ratings."userId") AS r_count
FROM ratings
GROUP BY ratings."userId"
ORDER BY r_count DESC
LIMIT 5;
"""
task_4 = pd.read_sql(query, engine)
task_4

   userId  r_count
0     414     2698
1     599     2478
2     474     2108
3     448     1864
4     274     1346

### 5. When was done first and last rate included in data set and what was the rated movie tittle?

In [12]:
query = """
WITH first_and_last AS (
    SELECT MIN(ratings.timestamp) AS first_rate, MAX(ratings.timestamp) AS last_rate
    FROM ratings
)
SELECT movies.title, ratings.timestamp
FROM ratings
JOIN movies ON movies."movieId" = ratings."movieId"
WHERE ratings.timestamp = (SELECT first_rate FROM first_and_last) OR ratings.timestamp = (SELECT last_rate FROM first_and_last);
"""
task_5 = pd.read_sql(query, engine)
task_5['timestamp'] = pd.to_datetime(task_5['timestamp'], unit='s')
task_5.sort_values(by='timestamp').reset_index(drop=True)

                                                title           timestamp
0                                      Copycat (1995) 1996-03-29 18:36:55
1                           Dances with Wolves (1990) 1996-03-29 18:36:55
2                                      Aladdin (1992) 1996-03-29 18:36:55
3   Englishman Who Went Up a Hill But Came Down a ... 1996-03-29 18:36:55
4                                  Cliffhanger (1993) 1996-03-29 18:36:55
5   City Slickers II: The Legend of Curly's Gold (... 1996-03-29 18:36:55
6                                 Black Beauty (1994) 1996-03-29 18:36:55
7                        Beverly Hills Cop III (1994) 1996-03-29 18:36:55
8                             Corrina, Corrina (1994) 1996-03-29 18:36:55
9                                       Batman (1989) 1996-03-29 18:36:55
10                    Clear and Present Danger (1994) 1996-03-29 18:36:55
11                                   Drop Zone (1994) 1996-03-29 18:36:55
12                                  Disclosure (1994) 1996-03-29 18:36:55
13                           Circle of Friends (1995) 1996-03-29 18:36:55
14                            Boys on the Side (1995) 1996-03-29 18:36:55
15                  Die Hard: With a Vengeance (1995) 1996-03-29 18:36:55
16                                Crimson Tide (1995) 1996-03-29 18:36:55
17                                   Apollo 13 (1995) 1996-03-29 18:36:55
18                      Baby-Sitters Club, The (1995) 1996-03-29 18:36:55
19                        Beauty and the Beast (1991) 1996-03-29 18:36:55
20                                       Crumb (1994) 2018-09-24 14:27:30

### 6. All movies released in 1990

In [13]:
query = """
SELECT title 
FROM movies 
WHERE movies.title LIKE '%(1990)%';
"""
task_6 = pd.read_sql(text(query), engine)
task_6

                                                 title
0                                    Home Alone (1990)
1                                         Ghost (1990)
2                            Dances with Wolves (1990)
3                                  Pretty Woman (1990)
4                               Days of Thunder (1990)
..                                                 ...
142  Dragon Ball Z: Bardock - The Father of Goku (D...
143               I Bought a Vampire Motorcycle (1990)
144                                Maniac Cop 2 (1990)
145                          Jetsons: The Movie (1990)
146                         The Forbidden Dance (1990)

[147 rows x 1 columns]